In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt

In [3]:
# leer el dataset online_retail_cleaned.csv
df = pd.read_csv('online_retail_cleaned.csv')

In [4]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541759 entries, 0 to 541758
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541759 non-null  object
 1   StockCode    541759 non-null  object
 2   Description  541759 non-null  object
 3   Quantity     541759 non-null  int64
 4   InvoiceDate  541759 non-null  object
 5   UnitPrice    541759 non-null  float64
 6   CustomerID   541759 non-null  float64
 7   Country      541759 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [6]:
# transformar la columna 'InvoiceDate' a tipo datetime
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541759 entries, 0 to 541758
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541759 non-null  object
 1   StockCode    541759 non-null  object
 2   Description  541759 non-null  object
 3   Quantity     541759 non-null  int64
 4   InvoiceDate  541759 non-null  datetime64[ns]
 5   UnitPrice    541759 non-null  float64
 6   CustomerID   541759 non-null  float64
 7   Country      541759 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [9]:
# transformar la columna 'CustomerID' a tipo int
df['CustomerID'] = df['CustomerID'].astype('Int64')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541759 entries, 0 to 541758
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541759 non-null  object
 1   StockCode    541759 non-null  object
 2   Description  541759 non-null  object
 3   Quantity     541759 non-null  int64
 4   InvoiceDate  541759 non-null  datetime64[ns]
 5   UnitPrice    541759 non-null  float64
 6   CustomerID   541759 non-null  Int64
 7   Country      541759 non-null  object
dtypes: Int64(1), datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 33.6+ MB

In [14]:
# agrupar por 'CustomerID' y 'InvoiceNo' para obtener el n√∫mero de compras por cliente
df_grouped = df.groupby(['CustomerID', 'InvoiceNo']).size().reset_index(name='PurchaseCount')

In [15]:
df_grouped_client.head()

   CustomerID         InvoiceDate  PurchaseCount
0       12345 2010-12-01 11:52:00              1
1       12345 2010-12-01 14:32:00            527
2       12345 2010-12-01 14:33:00              2
3       12345 2010-12-01 14:35:00              1
4       12345 2010-12-01 14:37:00              2

In [16]:
df_grouped.head()

   CustomerID InvoiceNo  PurchaseCount
0       12345    536414              1
1       12345    536544            527
2       12345    536546              1
3       12345    536547              1
4       12345    536553              1

In [18]:
df['CustomerID'].unique().shape[0]

4373

In [19]:
df['InvoiceNo'].unique().shape[0]

25750

### Las 25.750 compras unicas realizadas fueron ejecutadas por 4.373 clientes unicos.

In [20]:
# Crear un dataframe Eliminando las columnas de 'Description' y 'Country'
df_client = df.drop(columns=['Description', 'Country'])

In [22]:
df_client.head()

  InvoiceNo StockCode  Quantity         InvoiceDate  UnitPrice  CustomerID
0    536365    85123A         6 2010-12-01 08:26:00       2.55       17850
1    536365     71053         6 2010-12-01 08:26:00       3.39       17850
2    536365    84406B         8 2010-12-01 08:26:00       2.75       17850
3    536365    84029G         6 2010-12-01 08:26:00       3.39       17850
4    536365    84029E         6 2010-12-01 08:26:00       3.39       17850

In [23]:
# Agregar nueva columna 'TotalSpent' que es el producto de 'Quantity' y 'UnitPrice'
df_client['TotalSpent'] = df_client['Quantity'] * df_client['UnitPrice']

In [24]:
df_client.head()

,InvoiceNo,StockCode,Quantity,InvoiceDate,UnitPrice,CustomerID,TotalSpent
0,536365,85123A,6,2010-12-01 08:26:00,2.55,17850,15.30
1,536365,71053,6,2010-12-01 08:26:00,3.39,17850,20.34
2,536365,84406B,8,2010-12-01 08:26:00,2.75,17850,22.00
3,536365,84029G,6,2010-12-01 08:26:00,3.39,17850,20.34
4,536365,84029E,6,2010-12-01 08:26:00,3.39,17850,20.34

In [26]:
# Sumar 'TotalSpent' por 'CustomerID' y 'InvoiceNo'
df_client_grouped = df_client.groupby(['CustomerID', 'InvoiceNo']).agg({'TotalSpent': 'sum'}).reset_index()

In [27]:
df_client_grouped.head()

   CustomerID InvoiceNo  TotalSpent
0       12345    536414        0.00
1       12345    536544     5521.14
2       12345    536546        0.00
3       12345    536547        0.00
4       12345    536553        0.00

In [29]:
# Agrupar por 'CustomerID' para obtener el total gastado por cliente
df_client_total = df_client_grouped.groupby('CustomerID').agg({'TotalSpent': 'sum'}).reset_index()

In [30]:
# Mostrar los 20 clientes que m√°s han gastado
top_20_customers = df_client_total.nlargest(20, 'TotalSpent')

In [31]:
top_20_customers.head(20)

      CustomerID  TotalSpent
0          12345  1680264.68
1704       14646   279489.02
4234       18102   256438.49
3759       17450   187482.17
1896       14911   132572.62
56         12415   123725.45
1346       14156   113384.14
3802       17511    88125.38
3203       16684    65892.08
1006       13694    62653.10
2193       15311    59419.34
569        13089    57385.88
1301       14096    57120.91
2000       15061    54228.74
4126       17949    52750.84
2538       15769    51823.72
2723       16029    50992.61
1448       14298    50862.44
1296       14088    50415.49
4043       17841    40340.78

In [36]:
# Sumar todas las compras del dataset con dos decimales, printar el resultado
df_client['TotalSpent'] = df_client['TotalSpent'].round(2)
print(f'Total spent in the dataset: {df_client["TotalSpent"].sum():.2f} ‚Ç¨')

Total spent in the dataset: 10019300.49 ‚Ç¨

In [39]:
# Calcular el porcentaje de gasto del cliente con ID 12345 del total gastado en el dataset
customer_id = 12345
customer_spent = df_client_total[df_client_total['CustomerID'] == customer_id]['TotalSpent'].values[0]
total_spent = df_client['TotalSpent'].sum()
percentage_spent = (customer_spent / total_spent) * 100
print(f'Customer {customer_id} spent {percentage_spent:.2f}% of the total in the dataset.')

Customer 12345 spent 16.77% of the total in the dataset.

,InvoiceNo,StockCode,Quantity,InvoiceDate,UnitPrice,CustomerID,TotalSpent
622,536414,22139,56,2010-12-01 11:52:00,0.00,12345,0.00
1443,536544,21773,1,2010-12-01 14:32:00,2.51,12345,2.51
1444,536544,21774,2,2010-12-01 14:32:00,2.51,12345,5.02
1445,536544,21786,4,2010-12-01 14:32:00,0.85,12345,3.40
1446,536544,21787,2,2010-12-01 14:32:00,1.66,12345,3.32

### Parte de Jorge.
Mdia de gasto por cliente.